[
  {
    "title": "My Updated Post",
    "content": "My first updated post!\r\n\r\nThis is exciting!",
    "user_id": 1
  },
  {
    "title": "A Second Post",
    "content": "This is a post from a different user...",
    "user_id": 2
  },
  {
    "title": "This is the Third Post",
    "content": "This is a post from a different user... again",
    "user_id": 3
  },
  {
    "title": "Bitcoin pops 12% to $40,000 after Tudor Jones endorsement, Musk’s about-face on accepting crypto",
    "content": "Bitcoin’s price surged after Tesla CEO Elon Musk said Sunday the electric vehicle maker could accept bitcoin transactions again in future.\n\nThe cryptocurrency then took another leg higher above $40,000 on bullish comments by legendary investor Paul Tudor Jones.\n\nBitcoin jumped 12.5% to $40,178 in 24 hours, according to Coinbase. The cryptocurrency started Sunday trading at just $34,880. Since the start of the year, bitcoin has surged more than 30%, though it has experienced wild swings. It hit an all-time high of $64,829.14 in April and hit a low near $30,000 in May following a 30% intraday crash.\r\n\r\nRead more here: https://www.cnbc.com/2021/06/14/bitcoin-btc-soars-after-musk-says-tesla-could-accept-the-crypto-again.html",
    "user_id": 1
  },
  {
    "title": "Bitcoin Attempts Range Breakout; Faces Resistance at $42K",
    "content": "Bitcoin (BTC) held support around $34,000 over the weekend and is approaching resistance around $40,000-$42,000. The world’s largest cryptocurrency has been consolidating for nearly a month as buyers established a solid base around $30,000.\n\nA breakout from the range would yield further upside towards $50,000. However, sellers remain in control given strong overhead resistance.\n\nBitcoin was trading around $39,300 at press time and is up about 9% over the past 24-hours.\n\n    The short-term trend is improving as price returned above the 100-period moving average on the four-hour chart.\n\n    There is immediate resistance at $40,000 which could limit upside, especially as the relative strength index (RSI) appears overbought on the four-hour chart.\n\n    Minor support is seen around $34,000 which is the mid-point of the short-term range. If support holds, a decisive breakout above $42,000 could shift the downtrend from May. \r\n\r\nSource: https://finance.yahoo.com/news/bitcoin-attempts-range-breakout-faces-112742715.html ",
    "user_id": 1
  },
  {
    "title": "I Like Bitcoin as Portfolio Diversifier: Billionaire Paul Tudor Jones ",
    "content": "US billionaire and hedge fund manager, Paul Tudor Jones, has been talking to the CNBC at the Squawk Box show and shared his take on why Bitcoin’s market capitalization has been growing but the price of gold to USD has hardly increased.\n“I like Bitcoin as a portfolio diversifier”\r\n\r\nRead more: https://u.today/i-like-bitcoin-as-portfolio-diversifier-billionaire-paul-tudor-jones",
    "user_id": 1
  },
  {
    "title": "Coinbase, MicroStrategy, Riot Blockchain among stocks gaining as bitcoin hits $40K",
    "content": " Bitcoin (BTC-USD) retakes $40K after Elon Musk says Tesla will resume accepting the cryptocurrency for payment once bitcoin miners provide evidence that at least half of their energy usage is coming from \"clean\" sources.\nThat's not only helping the world's largest crypto by market cap\r\n\r\nRead more: https://seekingalpha.com/news/3706025-coinbase-microstrategy-riot-blockchain-among-stocks-gaining-as-bitcoin-hits-40k?utm_source=coinmarketcap.com&utm_medium=referral",
    "user_id": 3
  },
  {
    "title": "Thai regulators ban exchanges from trading meme tokens and NFTs",
    "content": "Digital asset platforms can no longer trade meme-based tokens, non-fungible tokens (NFTs) and exchange-issued tokens in Thailand after the country’s Securities and Exchange Commission banned them on Friday, according to the Bangkok Post. \n\nThe ban applies to tokens like Dogecoin, which was created as a joke but has gained a lot of popularity in the crypto space. It also includes NFTs, which are unique tokens that represent digital files like images and sound.\r\n\r\nRead more: https://coinmarketcap.com/headlines/news/thai-regulators-ban-exchanges-from-trading-meme-tokens-and-nfts/",
    "user_id": 2
  },
  {
    "title": "South Korean Banks to Follow New Crypto Restrictions",
    "content": "South Korea is introducing new banking restrictions to regulate crypto exchanges. The country’s bankers association will also hold a meeting to discuss new rules for reducing their liability on servicing crypto businesses. \r\n\r\nRead more: https://cryptobriefing.com/south-korean-banks-to-follow-new-crypto-restrictions/ ",
    "user_id": 1
  },
  {
    "title": "What will happen to Shiba Inu coin by 2025?",
    "content": "Shiba Inu coin — the meme-based cryptocurrency that has been billed as a “Dogecoin killer” — has not gone away yet, despite a recent dip in cryptocurrencies. But will Shib coin ever reach the $1 mark? \r\n\r\nRead more: https://www.deseret.com/2021/6/8/22524104/shib-coin-shiba-inu-predictions-2025",
    "user_id": 2
  },
  {
    "title": "Elon Musk interested in holding a Dogecoin festival",
    "content": "The SpaceX founder is known to be a fan of the Shiba Inu cryptocurrency. Not only does his aerospace manufacturing firm now accept the meme-inspired coins, but Musk appears to be doing everything he can to send the ‘doge’ “to the moon”, including naming a new satellite after the crypto. \n\nElon Musk is flirting with the idea of having a Dogecoin-themed festival, after some crypto enthusiasts suggested on Twitter. \n\r\n\r\nRead more: https://smlawassociate.com/index.php/2021/06/03/elon-musk-interested-in-holding-a-dogecoin-festival/",
    "user_id": 1
  },
  {
    "title": "Dogecoin jumps 35% following Coinbase listing",
    "content": "Dogecoin cryptocurrency could be traded on Coinbase from as early as 3 June\n\nDogecoin surged on Wednesday after the US cryptocurrency exchange Coinbase announced that it will add the meme crypto to its professional trading platform.\n\nThe company said that the crypto will be available later from or after 09:00 PT (UTC -7) on 3 June “if liquidity conditions are met,” adding that there will be a “separate announcement if and when” the cryptocurrency is ever added to its main site.\r\n\r\nRead More: https://currency.com/dogecoin-jumps-35-following-coinbase-listing",
    "user_id": 3
  },
  {
    "title": "Revolut Adds Dogecoin to Crypto Offering",
    "content": "DOGE is the 30th crypto to be made available on Revolut's platform.\r\n\r\nU.K.-based digital banking service Revolut added dogecoin (DOGE, +6.22%) to its crypto offering in response to widespread demand from its users.\n\n    Dogecoin is the 30th token to be made available on Revolut, the fintech announced via email Tuesday.\n    Revolut is adding new tokens every Tuesday in a program that started June 1 with the addition of eight tokens including algorand (ALGO, +6.01%) and polygon.\n    \"One of the most popular user requests over the past couple of months has been to add dogecoin and we have answered the call,\" Ed Cooper, Revolut's head of crypto, said in the email.\n    Revolut began offering crypto trading in 2017, coming in for criticism for not allowing customers to withdraw their holdings to other exchanges. That is changing with the beta release of bitcoin (BTC, +12.4%) withdrawals to as many as three addresses for some of its U.K. customers.\n    Subject to take up, the service will be extended to other cryptocurrencies and customers in other markets in the coming months. \n Source: https://www.coindesk.com/revolut-adds-dogecoin-to-crypto-offering",
    "user_id": 2
  },
  {
    "title": "Will Shiba Inu coin rise again? Here’s what to expect",
    "content": "Shiba Inu coin dropped recently due to the general cryptocurrency dip — but it could be in store for a rebound.\r\n\r\nRead more: https://www.deseret.com/2021/6/13/22529368/shib-coin-shiba-inu-price-value-forecast",
    "user_id": 3
  },
  {
    "title": "No DOGE Allowed? Thai SEC Bans Meme, Fan and Exchange Tokens as Well as NFTs",
    "content": "The move by the Thai SEC is just the latest action by the regulator as it works to provide a framework for crypto in the kingdom.\r\n\r\nThailand’s Securities and Exchange Commission (SEC) announced Friday it’s banned several of the hottest types of tokens in cryptocurrency including meme tokens, fan tokens and non-fungible tokens (NFTs) in an apparent attempt to rein in trading in crypto instruments in which the prices are largely determined by social whim. The move by the Thai SEC is just the latest action by the regulator as it works to provide a framework for crypto in the kingdom. While not looking to ban crypto altogether, the regulator has opted for a protective stance to prevent regular subjects and even traders from risking their funds through crypto investments.\n\nPer the SEC, the following are no longer allowed to be traded in Thailand, effective June 11:     Meme tokens, which the SEC describes as having no clear objective or substance or no support with the price depending on the trend in the social world. Though not mentioned by name, presumably this applies to meme-based coins such as Dogecoin (DOGE), the price of which has influenced to a massive degree by celebrities, most notably Elon Musk.\n    Fan tokens, digital assets that are created by personal preference.\n    NFT, which for a few brief months this year was the hottest sector of crypto. They are digital assets that represent a wide range of unique tangible and intangible items, from collectible sports cards to virtual real estate and even digital sneakers. Unlike regular cryptocurrencies, NFTs cannot be directly exchanged with one another.\n    Exchange tokens such as those issued by Binance (BNB), Uniswap (UNI), FTX (FTT) that allow holders to get benefits such as reduced transaction fees on the corresponding exchange. Exchanges have 30 days from the effective date to amend their listing rules to reflect the new regulations.\n\nCORRECT (June 13, 13:24 UTC): Changes definition of “Fan Tokens” and adds that exchanges must amend their listing rules to reflect the new regulations within 30 days of the effective date. \n Source: https://www.coindesk.com/no-doge-allowed-thai-sec-bans-meme-fan-and-exchange-tokens-as-well-as-nfts ",
    "user_id": 1
  },
  {
    "title": "Want to Buy Dogecoin? Read This First",
    "content": "All the information you need is here: \r\n\r\nSource: https://www.coindesk.com/buy-dogecoin-risk ",
    "user_id": 3
  }
]